v2206/atmospheric_AloisLuggerPlatz/test_urban/0.orig/alphat
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// dimensions      [1 -1 -1 0 0 0 0]; // for compressible
dimensions      [0 2 -1 0 0 0 0]; // for incompressible

internalField   uniform 0.1; 

boundaryField
{
    west
    {
        type            calculated;
        value           uniform 0.1; 
    }
    east
    {
        type            calculated;
        value           uniform 0.1; 
    }
    top
    {
        type            slip;
    }
    ground
    {
        type            alphatJayatillekeWallFunction;
        Prt             0.85;
        value           uniform 0.1; 
    }
    north
    {
        type            calculated;
        value           uniform 0.1;
    }
    south
    {
        type            calculated;
        value           uniform 0.1;
    }
    buildings
    {
        type            alphatJayatillekeWallFunction;
        Prt             0.85;
        value           uniform 0.1; 
    }

    // west
    // {
    //     type            calculated;
    //     value           uniform 0.1; 
    // }
    // east
    // {
    //     type            calculated;
    //     value           uniform 0.1; 
    // }
    // top
    // {
    //     type            slip;
    // }
    // ground
    // {
    //     type            compressible::alphatWallFunction;
    //     Prt             0.85;
    //     value           uniform 0.1; 
    // }
    // north
    // {
    //     type            calculated;
    //     value           uniform 0.1;
    // }
    // south
    // {
    //     type            calculated;
    //     value           uniform 0.1;
    // }
    // buildings
    // {
    //     type            compressible::alphatWallFunction;
    //     Prt             0.85;
    //     value           uniform 0.1; 
    // }
}


// ************************************************************************* //
